/* Combined English Source for Open edX iOS */
"AppDates.DATES.TITLE" = "Sanalar";
"AppDates.DATES.PAST_DUE" = "Muddati o‘tgan";
"AppDates.DATES.TODAY" = "Bugun";
"AppDates.DATES.THIS_WEEK" = "Ushbu hafta";
"AppDates.DATES.NEXT_WEEK" = "Keyingi hafta";
"AppDates.DATES.UPCOMING" = "Kelgusi";
"AppDates.EMPTY.TITLE" = "Sanalar yo‘q";
"AppDates.EMPTY.SUBTITLE" = "Hozirda sizda rejalashtirilgan tadbirlari boʻlgan faol kurslar mavjud emas. Muhim sanalar va muddatlarni ko'rish uchun kursga yoziling.";
"AppDates.SHIFT_DUE_DATES.TITLE" = "Ba‘zi muddatlarni o‘tkazib yubordingizmi?";
"AppDates.SHIFT_DUE_DATES.DESCRIPTION" = "Xavotir olmang – belgilangan topshiriqlarni hech qanday taraqqiyotni yo‘qotmasdan bajarish uchun tavsiya etilgan jadvalimizni o‘zgartiring.";
"AppDates.SHIFT_DUE_DATES.BUTTON" = "Muddatlarni surish";
"Profile.TITLE" = "Profil";
"Profile.INFO" = "Profil ma'lumotlari";
"Profile.ABOUT" = "Men haqimda";
"Profile.EDIT_PROFILE" = "Profilni tahrirlash";
"Profile.YEAR_OF_BIRTH" = "Tug‘ilgan yil:";
"Profile.BIO" = "Bio:";
"Profile.SETTINGS" = "Sozlamalar";
"Profile.SETTINGS_VIDEO" = "Video sozlamalari";
"Profile.DATES_AND_CALENDAR" = "Sanalar va kalendar";
"Profile.SUPPORT_INFO" = "Qo‘llab-quvvatlash ma‘lumotlari";
"Profile.CONTACT" = "Qo‘llab-quvvatlash xizmatiga murojaat qiling";
"Profile.TERMS" = "Foydalanish shartlari";
"Profile.PRIVACY" = "Maxfiylik siyosati";
"Profile.COOKIE_POLICY" = "Cookie siyosati";
"Profile.CURRENT_LEARNING_SITE" = "";
"Profile.DO_NOT_SELL_INFORMATION" = "Mening shaxsiy ma'lumotlarimni sotmang";
"Profile.FAQ_TITLE" = "Tez-tez so‘raladigan savollarni ko‘rish";
"Profile.MANAGE_ACCOUNT" = "Accountni boshqarish";
"Profile.LEARNING_SITES" = "";
"Profile.LOGOUT" = "Chiqish";
"Profile.SWITCH_TO" = "ga o‘tish";
"Profile.FULL_PROFILE" = "to‘liq profil";
"Profile.LIMITED_PROFILE" = "cheklangan profil";
"Profile.LOGOUT_ALERT.TITLE" = "Chiqishni tasdiqlang";
"Profile.LOGOUT_ALERT.TEXT" = "Haqiqatan ham tizimdan chiqmoqchimisiz?";
"Profile.DELETE_ALERT.TITLE" = "Ogohlantirish!";
"Profile.DELETE_ALERT.TEXT" = "Haqiqatan ham accountingizni o‘chirib tashlamoqchimisiz?";
"Profile.UNSAVED_DATA_ALERT.TITLE" = "Saqlamasdan ketasizmi?";
"Profile.UNSAVED_DATA_ALERT.TEXT" = "Siz kiritgan o‘zgarishlar bekor qilinadi.";
"Profile.EDIT.TOO_YONG_USER" = "Ma'lumotga to‘liq kirish huquqiga ega profilga ega bo‘lish uchun 13 yoshdan katta bo‘lishingiz kerak.";
"Profile.EDIT.LIMITED_PROFILE_DESCRIPTION" = "Cheklangan profil faqat foydalanuvchi nomingiz va profil rasmingizni baham ko‘radi.";
"Profile.EDIT.DELETE_ACCOUNT" = "Accountni o‘chirish";
"Profile.EDIT.FIELDS.YEAR_OF_BIRTH" = "Tug‘ilgan yil";
"Profile.EDIT.FIELDS.LOCATION" = "Joylashuv";
"Profile.EDIT.FIELDS.SPOKEN_LANGUGAE" = "Og‘zaki til";
"Profile.EDIT.FIELDS.ABOUT_ME" = "Men haqimda:";
"Profile.EDIT.BOTTOM_SHEET.TITLE" = "Profil rasmini o‘zgartirish";
"Profile.EDIT.BOTTOM_SHEET.SELECT" = "Galereyadan tanlang";
"Profile.EDIT.BOTTOM_SHEET.REMOVE" = "Fotosuratni o‘chirish";
"Profile.EDIT.BOTTOM_SHEET.CANCEL" = "Bekor qilish";
"Profile.DELETE_ACCOUNT.TITLE" = "Accountni o‘chirish";
"Profile.DELETE_ACCOUNT.ARE_YOU_SURE" = "Haqiqatan ham xohlaysizmi ";
"Profile.DELETE_ACCOUNT.WANT_TO_DELETE" = "Accountingizni o‘chirib tashlaysizmi?";
"Profile.DELETE_ACCOUNT.DESCRIPTION" = "Ushbu amalni tasdiqlash uchun account qaydnomangiz parolini kiriting.";
"Profile.DELETE_ACCOUNT.PASSWORD" = "Parol";
"Profile.DELETE_ACCOUNT.PASSWORD_DESCRIPTION" = "Parolni kiriting";
"Profile.DELETE_ACCOUNT.CONFIRM" = "Ha, accountni o‘chirib tashlang";
"Profile.DELETE_ACCOUNT.BACK_TO_PROFILE" = "Profilga qaytish";
"Profile.DELETE_ACCOUNT.INCORRECT_PASSWORD" = "Parol noto‘g‘ri. Iltimos, qayta urinib ko‘ring.";
"Profile.SETTINGS.VIDEO_SETTINGS_TITLE" = "Video sozlamalari";
"Profile.SETTINGS.WIFI_TITLE" = "Faqat Wi-Fi yuklab olish";
"Profile.SETTINGS.WIFI_DESCRIPTION" = "Kontentni faqat Wi-Fi yoqilganda yuklab oling";
"Profile.SETTINGS.VIDEO_QUALITY_TITLE" = "Video oqim sifati";
"Profile.SETTINGS.VIDEO_QUALITY_DESCRIPTION" = "Avtomatik (tavsiya etiladi)";
"Profile.SETTINGS.QUALITY_AUTO_TITLE" = "Avtomatik";
"Profile.SETTINGS.QUALITY_AUTO_DESCRIPTION" = "Tavsiya etilgan";
"Profile.SETTINGS.QUALITY_360_TITLE" = "360p";
"Profile.SETTINGS.QUALITY_360_DESCRIPTION" = "Kamroq maʼlumotlardan foydalanish";
"Profile.SETTINGS.QUALITY_540_TITLE" = "540p";
"Profile.SETTINGS.QUALITY_720_TITLE" = "720p";
"Profile.SETTINGS.QUALITY_720_DESCRIPTION" = "Eng yaxshi sifat";
"Profile.SETTINGS.VERSION" = "Versiya:";
"Profile.SETTINGS.UP_TO_DATE" = "Hozirgi kungacha";
"Profile.SETTINGS.TAP_TO_UPDATE" = "Versiyaga yangilash uchun bosing";
"Profile.SETTINGS.TAP_TO_INSTALL" = "Kerakli ilova yangilanishini o‘rnatish uchun bosing";
"Profile.ERROR.CANNOT_SEND_EMAIL" = "Email yuborib bo‘lmaydi. Email mijozingiz sozlanmaganga o‘xshaydi.";
"Profile.CALENDAR.NEW_CALENDAR" = "Yangi kalendar";
"Profile.CALENDAR.CHANGE_SYNC_OPTIONS" = "Sinxronizatsiya parametrlarini o‘zgartiring";
"Profile.CALENDAR.ACCOUNT" = "Account";
"Profile.CALENDAR.CALENDAR_NAME" = "Kalendar nomi";
"Profile.CALENDAR.COLOR" = "Rang";
"Profile.CALENDAR.UPCOMING_ASSIGNMENTS" = "Faol kurslar uchun kelgusi topshiriqlar ushbu kalendarda paydo bo‘ladi";
"Profile.CALENDAR.CANCEL" = "Bekor qilish";
"Profile.CALENDAR.BEGIN_SYNCING" = "Sinxronlashni boshlang";
"Profile.ASSIGNMENT_STATUS.SYNCED" = "Sinxronlangan";
"Profile.ASSIGNMENT_STATUS.FAILED" = "Sinxronlash amalga oshmadi";
"Profile.ASSIGNMENT_STATUS.OFFLINE" = "Oflayn";
"Profile.ASSIGNMENT_STATUS.SYNCING" = "Taqvim bilan sinxronlanmoqda...";
"Profile.CALENDAR_DIALOG.CALENDAR_ACCESS" = "Kalendarga kirish";
"Profile.CALENDAR_DIALOG.DISABLE_CALENDAR_SYNC" = "Taqvim sinxronlashni o‘chirib qo‘ying";
"Profile.CALENDAR_DIALOG.CALENDAR_ACCESS_DESCRIPTION" = "Taqvimingizda kelgusi topshiriqlar va kurs bosqichlarini ko‘rsatish uchun taqvimingizga kirishga ruxsat kerak.";
"Profile.CALENDAR_DIALOG.DISABLE_CALENDAR_SYNC_DESCRIPTION" = "Taqvim sinxronlashni o‘chirib qo‘ysangiz, “ %@ ” taqvimi o‘chiriladi. Istalgan vaqtda taqvim sinxronlashni qayta yoqishingiz mumkin.";
"Profile.CALENDAR_DIALOG.GRANT_CALENDAR_ACCESS" = "Taqvimga ruxsat bering";
"Profile.CALENDAR_DIALOG.DISABLE_SYNCING" = "Sinxronizatsiyani o‘chirib qo‘ying";
"Profile.CALENDAR_DIALOG.CANCEL" = "Bekor qilish";
"Profile.DATES_AND_CALENDAR.TITLE" = "Sanalar va kalendar";
"Profile.CALENDAR_SYNC.TITLE" = "Kalendarni sinxronlash";
"Profile.CALENDAR_SYNC.DESCRIPTION" = "Taqvimingizda kelgusi topshiriqlaringiz va kurs bosqichlarini ko‘rsatish uchun taqvim sinxronlashni sozlang. Yangi topshiriqlar va oʻzgartirilgan kurs sanalari avtomatik ravishda sinxronlanadi";
"Profile.CALENDAR_SYNC.BUTTON" = "Taqvim sinxronlashni sozlash";
"Profile.OPTIONS.TITLE" = "Variantlar";
"Profile.OPTIONS.USE_RELATIVE_DATES" = "Nisbiy sanalardan foydalaning";
"Profile.OPTIONS.SHOW_RELATIVE_DATES" = "\"Ertaga\" va \"Kecha\" kabi nisbiy sanalarni ko‘rsatish";
"Profile.OPTIONS.SHOW_FULL_DATES" = "“2021-yil 1-yanvar” kabi toʻliq sanalarni koʻrsatish";
"Profile.DATES_AND_CALENDAR.TITLE" = "Sanalar va kalendar";
"Profile.COURSE_CALENDAR_SYNC.TITLE" = "Kurs kalendarini sinxronlash";
"Profile.COURSE_CALENDAR_SYNC.DESCRIPTION.RECONNECT_REQUIRED" = "Sinxronlashni davom ettirish uchun taqvimingizni qayta ulang";
"Profile.COURSE_CALENDAR_SYNC.DESCRIPTION.SYNCING" = "Hozirda tadbirlar taqvimingizga sinxronlanmoqda";
"Profile.COURSE_CALENDAR_SYNC.BUTTON.RECONNECT" = "Taqvimni qayta ulash";
"Profile.COURSE_CALENDAR_SYNC.BUTTON.CHANGE_SYNC_OPTIONS" = "Sinxronizatsiya parametrlarini o‘zgartiring";
"Profile.COURSES_TO_SYNC.SYNCING_COURSES" = "%d kurslarini sinxronlash";
"Profile.OPTIONS.TITLE" = "Variantlar";
"Profile.OPTIONS.USE_RELATIVE_DATES" = "Nisbiy sanalardan foydalaning";
"Profile.OPTIONS.SHOW_RELATIVE_DATES" = "\"Ertaga\" va \"Kecha\" kabi nisbiy sanalarni ko‘rsatish";
"Profile.COURSES_TO_SYNC.TITLE" = "Sinxronlash uchun kurslar";
"Profile.COURSES_TO_SYNC.DESCRIPTION" = "Kurs uchun sinxronlashni o‘chirib qo‘ysangiz, kursga ulangan barcha tadbirlar sinxronlangan kalendaringizdan olib tashlanadi.";
"Profile.COURSES_TO_SYNC.HIDE_INACTIVE_COURSES" = "Faol bo‘lmagan kurslarni yashirish";
"Profile.COURSES_TO_SYNC.HIDE_INACTIVE_COURSES_DESCRIPTION" = "Oxirgi oyda koʻrmagan kurslaringizdan voqealarni avtomatik o‘chirib tashlang";
"Profile.COURSES_TO_SYNC.INACTIVE" = "Faol emas";
"Profile.CALENDAR.DROPDOWN.ICLOUD" = "iCloud";
"Profile.CALENDAR.DROPDOWN.LOCAL" = "Mahalliy";
"Profile.CALENDAR.DROPDOWN_COLOR.ACCENT" = "Urg‘u";
"Profile.CALENDAR.DROPDOWN_COLOR.RED" = "Qizil";
"Profile.CALENDAR.DROPDOWN_COLOR.ORANGE" = "Apelsin";
"Profile.CALENDAR.DROPDOWN_COLOR.YELLOW" = "Sariq";
"Profile.CALENDAR.DROPDOWN_COLOR.GREEN" = "Yashil";
"Profile.CALENDAR.DROPDOWN_COLOR.BLUE" = "Moviy";
"Profile.CALENDAR.DROPDOWN_COLOR.PURPLE" = "Binafsha";
"Profile.CALENDAR.DROPDOWN_COLOR.BROWN" = "Jigarrang";
"Profile.CALENDAR.COURSE_DATES" = "%@ Kurs sanalari";
"Profile.DROP_DOWN_PICKER.SELECT" = "Tanlang";
"Profile.SYNC_SELECTOR.SYNCED" = "Sinxronlash uchun";
"Profile.SYNC_SELECTOR.NOT_SYNCED" = "Sinxronlanmagan";
"Profile.SYNC.NO_SYNCED" = "Sinxronlashtirilgan kurslar yo‘q";
"Profile.SYNC.NO_SYNCED_DESCRIPTION" = "Hozirda taqvimingizga hech qanday kurs sinxronlanmayapti.";
"Downloads.DOWNLOADS.TITLE" = "Yuklashlar";
"Downloads.DOWNLOADS.MANAGE_DOWNLOAD_SETTINGS" = "Yuklab olish sozlamalarini boshqarish";
"Downloads.DOWNLOADS.NO_COURSES_TO_DOWNLOAD.TITLE" = "Yuklab olinadigan tarkibga ega kurslar yo'q";
"Downloads.DOWNLOADS.NO_COURSES_TO_DOWNLOAD.DESCRIPTION" = "Hozirda yuklab olinadigan kontentga ega kurslar yo‘q.";
"Downloads.DOWNLOADS.CELL.DOWNLOADED" = "%@ yuklab olindi";
"Downloads.DOWNLOADS.CELL.ALL_DOWNLOADED" = "Barcha %@ yuklab olindi";
"Downloads.DOWNLOADS.CELL.AVAILABLE" = "%@ mavjud";
"Downloads.DOWNLOADS.CELL.DOWNLOAD_COURSE" = "Kurs yuklab olish";
"Downloads.DOWNLOADS.CELL.DOWNLOADING" = "Yuklab olinmoqda";
"Downloads.DOWNLOADS.CELL.LOADING_COURSE_STRUCTURE" = "Kurs tuzilmasi yuklanmoqda...";
"Downloads.MENU_OPTION.REMOVE" = "Yuklab olingan kurslarni olib tashlang";
"Downloads.MENU_OPTION.CANCEL" = "Yuklashni bekor qilish";
"Discovery.TITLE" = "Kashf qiling";
"Discovery.SEARCH" = "Qidiruv";
"Discovery.HEADER.TITLE_1" = "Yangi kashf qiling";
"Discovery.HEADER.TITLE_2" = "Keling, siz uchun yangi kurs topaylik.";
"Discovery.SEARCH.TITLE" = "Qidiruv natijalari";
"Discovery.SEARCH.EMPTY_DESCRIPTION" = "Kursni topish uchun yozishni boshlang";
"Discovery.UPDATE_REQUIRED_TITLE" = "Ilovani yangilash talab qilinadi";
"Discovery.UPDATE_REQUIRED_DESCRIPTION" = "OpenEdX ilovasining ushbu versiyasi eskirgan. O‘rganishni davom ettirish va eng so‘nggi funksiya va tuzatishlarni olish uchun oxirgi versiyaga yangilang.";
"Discovery.UPDATE_WHY_NEED" = "Nima uchun yangilashim kerak?";
"Discovery.UPDATE_DEPRECATED_APP" = "Ilovaning eskirgan versiyasi";
"Discovery.UPDATE_BUTTON" = "Yangilash";
"Discovery.UPDATE_ACCOUNT_SETTINGS" = "Account sozlamalari";
"Discovery.UPDATE_NEEDED_TITLE" = "Ilovani yangilash";
"Discovery.UPDATE_NEEDED_DESCRIPTION" = "Eng so‘nggi versiyaga yangilashni tavsiya qilamiz. Eng yangi funksiyalar va tuzatishlarni olish uchun hozir yangilang.";
"Discovery.UPDATE_NEEDED_NOT_NOW" = "Hozir emas";
"Discovery.UPDATE_NEW_AVALIABLE" = "Yangi yangilanish mavjud! Eng yangi funksiyalar va tuzatishlarni olish uchun hozir yangilang";
"Discovery.ALERT.LEAVING_APP_TITLE" = "Ilovadan chiqish";
"Discovery.ALERT.LEAVING_APP_MESSAGE" = "Endi siz ilovadan chiqib, brauzerni ochyapsiz";
"Discovery.DETAILS.TITLE" = "Kurs tafsilotlari";
"Discovery.DETAILS.VIEW_COURSE" = "Kursni ko‘rish";
"Discovery.DETAILS.ENROLL_NOW" = "Hozir ro‘yxatdan oʻting";
"Discovery.DETAILS.ENROLLMENT_DATE_IS_OVER" = "Siz ushbu kursga yozila olmaysiz, chunki ro‘yxatdan o‘tish muddati tugagan.";
"Discovery.DETAILS.ENROLLMENT_NO_INTERNET" = "Ushbu kursga yozilish uchun internetga ulanganingizga ishonch hosil qiling.";
"Discovery.DETAILS.COURSE_BANNER" = "Kurs banner";
"Discovery.ALERT.AUTHORIZATION" = "Avtorizatsiya";
"Discovery.ALERT.PLEASE_ENTER_THE_SYSTEM" = "Kursga yozilishni davom ettirish uchun tizimga kiring.";
"Discussion.TITLE" = "Munozaralar";
"Discussion.BANNER.DISCUSSIONS_IS_DISABLED" = "Kurs jamoasi tomonidan munozaralarga joylashtirish o‘chirib qo‘yilgan";
"Discussion.TOPICS.SEARCH" = "Barcha postlarni qidiring";
"Discussion.TOPICS.ALL_POSTS" = "Barcha xabarlar";
"Discussion.TOPICS.POST_IM_FOLLOWING" = "Men kuzatayotgan postlar";
"Discussion.TOPICS.MAIN_CATEGORIES" = "Asosiy toifalar";
"Discussion.TOPICS.UNNAMED" = "Nomsiz pastki kategoriya";
"Discussion.POSTS.SORT.RECENT_ACTIVITY" = "Oxirgi faoliyat";
"Discussion.POSTS.SORT.MOST_ACTIVITY" = "Eng ko‘p faollik";
"Discussion.POSTS.SORT.MOST_VOTES" = "Eng ko‘p ovozlar";
"Discussion.POSTS.NO_DISCUSSION.TITLE" = "Hozircha muhokamalar yo‘q";
"Discussion.POSTS.NO_DISCUSSION.DESCRIPTION" = "Birinchi munozarani yaratish uchun quyidagi tugmani bosing.";
"Discussion.POSTS.NO_DISCUSSION.CREATEBUTTON" = "Munozara yaratish";
"Discussion.POSTS.NO_DISCUSSION.ADD_POST" = "Post qo‘shing";
"Discussion.POSTS.FILTER.ALL_POSTS" = "Barcha xabarlar";
"Discussion.POSTS.FILTER.UNREAD" = "O‘qilmagan";
"Discussion.POSTS.FILTER.UNANSWERED" = "Javobsiz";
"Discussion.POSTS.CREATE_NEW_POST" = "Yangi post yaratish";
"Discussion.POSTS.ALERT.MAKE_SELECTION" = "Tanlov qiling";
"Discussion.POST.LAST_POST" = "Oxirgi xabar:";
"Discussion.THREAD.ALERT.COMMENT_ADDED" = "Fikr qo‘shildi";
"Discussion.THREAD.ADD_RESPONSE" = "Javob qo‘shing";
"Discussion.CREATE_THREAD.NEW_POST" = "Yangi post yaratish";
"Discussion.CREATE_THREAD.SELECT_POST_TYPE" = "Xabar turini tanlang";
"Discussion.CREATE_THREAD.TOPIC" = "Mavzu";
"Discussion.CREATE_THREAD.TITLE" = "Sarlavha";
"Discussion.CREATE_THREAD.FOLLOW_DISCUSSION" = "Ushbu muhokamani kuzatib boring";
"Discussion.CREATE_THREAD.FOLLOW_QUESTION" = "Bu savolga amal qiling";
"Discussion.CREATE_THREAD.CREATE_DISCUSSION" = "Yangi munozara yarating";
"Discussion.CREATE_THREAD.CREATE_QUESTION" = "Yangi savol yarating";
"Discussion.COMMENT.REPORT" = "Hisobot";
"Discussion.COMMENT.UNREPORT" = "Hisobotni bekor qilish";
"Discussion.COMMENT.FOLLOW" = "Kuzatish";
"Discussion.COMMENT.UNFOLLOW" = "Kuzatishdan voz kechish";
"Discussion.RESPONSE.COMMENTS_RESPONSES" = "Izoh";
"Discussion.RESPONSE.ALERT.COMMENT_ADDED" = "Fikr qo‘shildi";
"Discussion.RESPONSE.ADD_COMMENT" = "Fikr qo‘shing";
"Discussion.POST_TYPE.QUESTION" = "savol";
"Discussion.POST_TYPE.DISCUSSION" = "munozara";
"Discussion.SEARCH" = "Qidiruv";
"Discussion.SEARCH.TITLE" = "Qidiruv natijalari";
"Discussion.SEARCH.EMPTY_DESCRIPTION" = "Mavzularni topish uchun yozishni boshlang";
"Discussion.ANONYMOUS" = "Anonim";
"Discussion.ERROR.UNABLE_TO_LOAD_DISCUSSION" = "Munozaralarni yuklab bo‘lmadi.\n Keyinroq qayta urinib ko‘ring.";
"Course.OUTLINE.PASSED_THE_COURSE" = "Tabriklaymiz, siz ushbu kurs sertifikatini “ %@ \” da qo‘lga kiritdingiz.";
"Course.OUTLINE.VIEW_CERTIFICATE" = "Sertifikatni ko‘rish";
"Course.OUTLINE.CERTIFICATE" = "Sertifikat";
"Course.OUTLINE.COURSE_VIDEOS" = "Kurs videolari";
"Course.OUTLINE.COURSE_HASNT_STARTED" = "Bu kurs hali boshlanmagan.";
"Course.COURSEWARE.COURSE_CONTENT" = "Kurs mazmuni";
"Course.COURSEWARE.COURSE_UNITS" = "Kurs birliklari";
"Course.COURSEWARE.NEXT" = "Keyingisi";
"Course.COURSEWARE.PREVIOUS" = "Oldingi";
"Course.COURSEWARE.PREVIOUS_FULL" = "Oldingi";
"Course.COURSEWARE.FINISH" = "Tugatish";
"Course.COURSEWARE.GOOD_WORK" = "Yaxshi bajarilgan ish!";
"Course.COURSEWARE.BACK_TO_OUTLINE" = "Konturga qaytish";
"Course.COURSEWARE.SECTION" = "Siz tugatdingiz”";
"Course.COURSEWARE.IS_FINISHED" = "“.";
"Course.COURSEWARE.CONTINUE" = "Davom eting";
"Course.COURSEWARE.RESUME_WITH" = "Davom etish:";
"Course.ERROR.NO_INTERNET" = "Siz internetga ulanmagansiz. Internet ulanishingizni tekshiring.";
"Course.ERROR.RELOAD" = "Qayta yuklash";
"Course.ERROR.COMPONENT_NOT_FOUNT" = "Kurs komponenti topilmadi, qayta yuklang";
"Course.ERROR.HANDOUTS_UNAVAILABLE" = "Hozirda bu kurs uchun tarqatma materiallar mavjud emas.";
"Course.ERROR.ANNOUNCEMENTS_UNAVAILABLE" = "Hozirda ushbu kurs uchun e'lonlar yo'q.";
"Course.ERROR.VIDEOS_UNAVAILABLE" = "Ushbu kurs uchun videolar mavjud emas.";
"Course.ERROR.ASSIGNMENTS_UNAVAILABLE" = "Ushbu kurs uchun topshiriqlar mavjud emas.";
"Course.ERROR.COURSE_DATE_UNAVAILABLE" = "Kurs sanalari hozircha mavjud emas.";
"Course.ERROR.COURSEWARE_UNAVAILABLE" = "Hozircha kurs mazmuni mavjud emas.";
"Course.ALERT.ROTATE_DEVICE" = "Ushbu videoni toʻliq ekranda koʻrish uchun qurilmangizni aylantiring.";
"Course.ALERT.DELETE_ALL_VIDEOS" = "Haqiqatan ham barcha video(lar)ni oʻchirib tashlamoqchimisiz";
"Course.ALERT.DELETE_VIDEOS" = "Haqiqatan ham video(lar)ni o‘chirib tashlamoqchimisiz";
"Course.ALERT.STOP_DOWNLOADING" = "Kalit o‘chirilgan bo‘lsa, yuklab olish to‘xtatiladi va barcha yuklab olingan videolar o‘chiriladi";
"Course.ALERT.WARNING" = "Ogohlantirish";
"Course.COURSE_CONTAINER.HOME" = "Uy";
"Course.COURSE_CONTAINER.CONTENT" = "Tarkib";
"Course.COURSE_CONTAINER.PROGRESS" = "Taraqqiyot";
"Course.COURSE_CONTAINER.VIDEOS" = "Videolar";
"Course.COURSE_CONTAINER.OFFLINE" = "Oflayn";
"Course.COURSE_CONTAINER.DATES" = "Sanalar";
"Course.COURSE_CONTAINER.DISCUSSIONS" = "Munozaralar";
"Course.COURSE_CONTAINER.HANDOUTS" = "Ko‘proq";
"Course.COURSE_CONTAINER.HANDOUTS_IN_DEVELOPING" = "Tarqatma materiallar ishlab chiqilmoqda";
"Course.COURSE_CAROUSEL.PROGRESS_COMPLETION" = "Kursning %@%% qismini tugatdingiz";
"Course.COURSE_CAROUSEL.GRADES" = "Baholar";
"Course.COURSE_CAROUSEL.GRADES_DESCRIPTION" = "Bu sizning ushbu kursdan o&#39;tish uchun zarur bo&#39;lgan bahoga nisbatan og&#39;irlashtirilgan bahongizni bildiradi.";
"Course.COURSE_CAROUSEL.ALL_CONTENT" = "Barcha tarkib";
"Course.COURSE_CAROUSEL.UPGRADE_NOW_BODY" = "Siz hozir ushbu kursni tinglovchi sifatida o‘rganmoqdasiz va kurs materiallariga cheklangan kirish huquqiga egasiz.";
"Course.COURSE_CAROUSEL.UPGRADE_NOW_BUTTON" = "Hozir yangilang";
"Course.COURSE_CAROUSEL.ALL_VIDEOS_COMPLETED" = "Siz barcha videolarni ko‘rib bo‘ldingiz!";
"Course.COURSE_CAROUSEL.ALL_ASSIGNMENTS_COMPLETED" = "Siz barcha topshiriqlarni bajardingiz!";
"Course.COURSE_CAROUSEL.VIDEOS_COMPLETED" = "video\nTugallandi";
"Course.COURSE_CAROUSEL.ASSIGMENTS_COMPLETED" = "Topshiriqlar\nbajarildi";
"Course.COURSE_CAROUSEL.CONTINUE_WATCHING" = "Tomosha qilishni davom ettirish";
"Course.COURSE_CAROUSEL.NEXT_VIDEO" = "Keyingi Video";
"Course.COURSE_CAROUSEL.VIEW_ALL_VIDEOS" = "Barcha videolar";
"Course.COURSE_CAROUSEL.VIEW_ALL_ASSIGNMENTS" = "Hamma topshiriqlar";
"Course.COURSE_CAROUSEL.NEXT_ASSIGNMENTS" = "Keyingi topshiriq";
"Course.COURSE_CONTENT.ALL" = "Hammasi";
"Course.COURSE_CONTENT.VIDEOS" = "Videolar";
"Course.COURSE_CONTENT.ASSIGNMENTS" = "Topshiriqlar";
"Course.COURSE_CONTAINER.PROGRESS.TITLE" = "Kursni yakunlash";
"Course.COURSE_CONTAINER.PROGRESS.DESCRIPTION" = "Bu kurs mazmunining qancha qismini tamomlaganingizni ko&#39;rsatadi. E&#39;tibor bering, ba&#39;zi kontent hali chiqarilmasligi mumkin.";
"Course.COURSE_CONTAINER.PROGRESS.COMPLETED" = "Bajarildi";
"Course.COURSE_CONTAINER.PROGRESS.OVERALL_PROGRESS" = "Umumiy taraqqiyot";
"Course.COURSE_CONTAINER.PROGRESS.REMAINING" = "Qolgan";
"Course.COURSE_CONTAINER.PROGRESS.LOCKED" = "Qulflangan";
"Course.COURSE_CONTAINER.PROGRESS.GRADE_PROGRESS" = "Daraja Taraqqiyoti";
"Course.COURSE_CONTAINER.PROGRESS.PASSING" = "O‘tish";
"Course.COURSE_CONTAINER.PROGRESS.NOT_PASSING" = "O'tmadi";
"Course.COURSE_CONTAINER.PROGRESS.VIEW_CERTIFICATE" = "Sertifikatni ko'rish";
"Course.COURSE_CONTAINER.PROGRESS.SECTIONS_PROGRESS" = "Bo'limlar Taraqqiyoti";
"Course.COURSE_CONTAINER.PROGRESS.NO_PROGRESS_AVAILABLE" = "Mavjud taraqqiyot yo'q";
"Course.COURSE_CONTAINER.PROGRESS.START_LEARNING" = "O‘qishni boshlang va bu yerda o‘z yutuqlaringizni ko‘ring";
"Course.COURSE_CONTAINER.PROGRESS.OVERALL_GRADE" = "Umumiy baho";
"Course.COURSE_CONTAINER.PROGRESS.OVERALL_GRADE_DESCRIPTION" = "Bu sizning ushbu kursdan o&#39;tish uchun zarur bo&#39;lgan bahoga nisbatan og&#39;irlashtirilgan bahongizni bildiradi.";
"Course.COURSE_CONTAINER.PROGRESS.CURRENT_OVERALL_WEIGHTED_GRADE" = "Joriy Umumiy Og'irlik Bahosi:";
"Course.COURSE_CONTAINER.PROGRESS.WEIGHTED_GRADE_REQUIRED" = "Kursdan o'tish uchun %@%% og'irlikdagi baho talab qilinadi.";
"Course.COURSE_CONTAINER.PROGRESS.REQUIRED" = "Majburiy";
"Course.COURSE_CONTAINER.PROGRESS.GRADE_DETAILS" = "Baho Tafsilotlari";
"Course.COURSE_CONTAINER.PROGRESS.ASSIGNMENT_TYPE" = "Topshiriq turi";
"Course.COURSE_CONTAINER.PROGRESS.CURRENT_MAX_PERCENT" = "Joriy / Maks %%";
"Course.COURSE_CONTAINER.PROGRESS.COMPLETE" = "Bajarildi";
"Course.COURSE_CONTAINER.PROGRESS.OF_GRADE" = "Darajasi";
"Course.COURSE_CONTAINER.PROGRESS.NO_GRADED_ASSIGNMENTS" = "Bu kursda baholangan topshiriqlar mavjud emas.";
"Course.HANDOUTS_CELL_HANDOUTS.TITLE" = "Tarqatma materiallar";
"Course.HANDOUTS_CELL_ANNOUNCEMENTS.TITLE" = "E‘lonlar";
"Course.HANDOUTS_CELL_HANDOUTS.DESCRIPTION" = "Muhim kurs ma'lumotlarini toping";
"Course.HANDOUTS_CELL_ANNOUNCEMENTS.DESCRIPTION" = "Eng so‘nggi yangiliklardan xabardor bo‘ling";
"Course.NOT_AVALIABLE.TITLE" = "Ushbu interaktiv komponent mobil qurilmada mavjud emas";
"Course.NOT_AVALIABLE.DESCRIPTION" = "Ushbu kursning boshqa qismlarini oʻrganing yoki buni internetda koʻring.";
"Course.NOT_AVALIABLE.BUTTON" = "Brauzerda oching";
"Course.SUBTITLES.TITLE" = "Subtitrlar";
"Course.ACCESSIBILITY.DOWNLOAD" = "Yuklab olish";
"Course.ACCESSIBILITY.CANCEL_DOWNLOAD" = "Yuklashni bekor qilish";
"Course.ACCESSIBILITY.DELETE_DOWNLOAD" = "Yuklashni o‘chirish";
"Course.ACCESSIBILITY.PROGRESS_RING" = "Kursni tamomlash jarayoni halqasi";
"Course.ACCESSIBILITY.OVERALL_GRADE_SECTION" = "Umumiy baho bo'limi";
"Course.ACCESSIBILITY.GRADE_DETAILS_SECTION" = "Baholar tafsilotlari bo'limi";
"Course.ACCESSIBILITY.ASSIGNMENT_ITEM" = "Topshiriq elementi";
"Course.ACCESSIBILITY.REQUIRED_GRADE_INDICATOR" = "O‘tish uchun talab qilinadigan baho ko‘rsatkichi";
"Course.ACCESSIBILITY.PROGRESS_PERCENTAGE_COMPLETED" = "%@ foiz bajarildi";
"Course.ACCESSIBILITY.REQUIRED_GRADE_TO_PASS" = "%@ foiz o'tish uchun talab qilinadi";
"Course.ACCESSIBILITY.ASSIGNMENT_PROGRESS_DETAILS" = "%@, %@ dan %@ tugallandi, %@ foiz bahodan %@ foiz";
"Course.ACCESSIBILITY.CURRENT_GRADE" = "Joriy baho: %@ foiz";
"Course.ACCESSIBILITY.GRADE_REQUIREMENT_WARNING" = "O'tish uchun %@ foiz talab qilinadi: Baholash talabi haqida ogohlantirish";
"Course.ACCESSIBILITY.PROGRESS_VISUALIZATION" = "%@ topshiriq kategoriyalarini ko'rsatadigan taraqqiyot vizualizatsiyasi";
"Course.ACCESSIBILITY.OVERALL_PROGRESS_VALUE" = "Umumiy progress: %@ foiz";
"Course.ACCESSIBILITY.PROGRESS_HINT" = "Topshiriq turi bo'yicha taraqqiyot tahlili ko'rsatiladi";
"Course.ACCESSIBILITY.NO_GRADED_ASSIGNMENTS_HINT" = "Bu kursda ko'rsatiladigan baholangan topshiriqlar yo'q";
"Course.ACCESSIBILITY.NO_PROGRESS_HINT" = "Kurs faoliyatlarini yakunlang va bu yerda o'z yutuqlaringizni ko'rish";
"Course.ACCESSIBILITY.ASSIGNMENT_TYPE_HEADER" = "Vazifa turi ustun sarlavhasi";
"Course.ACCESSIBILITY.CURRENT_MAX_PERCENT_HEADER" = "Joriy va maksimal foiz ustun sarlavhasi";
"Course.ACCESSIBILITY.WEIGHT_CONTRIBUTION" = "Daraja vazni: %@ foiz";
"Course.ACCESSIBILITY.ASSIGNMENT_COMPLETION" = "%@ dan %@ tugallandi";
"Course.ACCESSIBILITY.ASSIGNMENT_GRADE_EARNED" = "Joriy baho: %@ dan %@ foiz";
"Course.ACCESSIBILITY.ASSIGNMENT_FULL_DETAILS" = "%@ dan %@ bajarildi. Bahoning og'irligi: %@ foiz. Joriy baho: %@ dan %@ foiz";
"Course.DOWNLOAD.DOWNLOADS" = "Yuklashlar";
"Course.DOWNLOAD.ALL_VIDEOS_DOWNLOADED" = "Barcha videolar yuklab olingan";
"Course.DOWNLOAD.DOWNLOADING_VIDEOS" = "Videolar yuklab olinmoqda...";
"Course.DOWNLOAD.DOWNLOAD_TO_DEVICE" = "Qurilmaga yuklab oling";
"Course.DOWNLOAD.VIDEOS" = "Videolar";
"Course.DOWNLOAD.REMAINING" = "Qolgan";
"Course.DOWNLOAD.UNTITLED" = "Sarlavhasiz";
"Course.DOWNLOAD.TOTAL" = "Jami";
"Course.DOWNLOAD.CHANGE_QUALITY_ALERT" = "Barcha videolar yuklab olayotganda yuklab olish video sifatini o‘zgartira olmaysiz";
"Course.DOWNLOAD.NO_WIFI_MESSAGE" = "Joriy yuklab olish sozlamalari faqat Wi-Fi orqali yuklab olishga ruxsat beradi.\n Wi-Fi tarmog‘iga ulaning yoki yuklab olish sozlamalarini o‘zgartiring.";
"Course.COURSE_DATES.TODAY" = "Bugun";
"Course.COURSE_DATES.COMPLETED" = "Bajarildi";
"Course.COURSE_DATES.PAST_DUE" = "Muddati o‘tgan";
"Course.COURSE_DATES.DUE_NEXT" = "Keyingi muddat";
"Course.COURSE_DATES.UNRELEASED" = "Chiqarilmagan";
"Course.COURSE_DATES.VERIFIED_ONLY" = "Faqat tasdiqlangan";
"Course.COURSE_DATES.ITEMS_HIDDEN" = "Elementlar yashirin";
"Course.COURSE_DATES.ITEM_HIDDEN" = "Element yashirin";
"Course.COURSE_DATES.TOAST_SUCCESS_TITLE" = "To‘lov sanalari o‘zgartirildi";
"Course.COURSE_DATES.TOAST_SUCCESS_MESSAGE" = "To‘g‘ri yo‘lda qolishingizga yordam berish uchun muddatlaringiz muvaffaqiyatli o‘zgartirildi.";
"Course.COURSE_DATES.VIEW_ALL_DATES" = "Barcha sanalarni ko‘rish";
"Course.COURSE_DATES.SYNC_TO_CALENDAR" = "Kalendar bilan sinxronlash";
"Course.COURSE_DATES.SYNC_TO_CALENDAR_MESSAGE" = "Ushbu kursning barcha muddatlari va tugash sanalarini taqvimingiz bilan avtomatik sinxronlashtiring.";
"Course.COURSE_DATES.ADD_CALENDAR_TITLE" = "Taqvim qo‘shing";
"Course.COURSE_DATES.REMOVE_CALENDAR_TITLE" = "Kalendarni olib tashlang";
"Course.COURSE_DATES.ADD_CALENDAR_PROMPT" = "\" %@ \" %@ taqvimini qo‘shishni xohlaysizmi?\n Siz istalgan vaqtda Taqvim yoki Sozlamalar orqali kurs taqvimini tahrirlashingiz yoki olib tashlashingiz mumkin";
"Course.COURSE_DATES.REMOVE_CALENDAR_PROMPT" = "\" %@ \" %@ taqvimini olib tashlamoqchimisiz?";
"Course.COURSE_DATES.DATES_ADDED_ALERT_MESSAGE" = "\" %@ \" taqvimingizga qo‘shildi.";
"Course.COURSE_DATES.CALENDAR_SYNC_MESSAGE" = "Taqvim sinxronlanmoqda...";
"Course.COURSE_DATES.CALENDAR_VIEW_EVENTS" = "Voqealar ko‘rish";
"Course.COURSE_DATES.CALENDAR_EVENTS_ADDED" = "Kurs taqvimingiz qo‘shildi.";
"Course.COURSE_DATES.CALENDAR_EVENTS_REMOVED" = "Kurs taqvimingiz olib tashlandi.";
"Course.COURSE_DATES.CALENDAR_EVENTS" = "Taqvim voqealari";
"Course.COURSE_DATES.CALENDAR_OUT_OF_DATE" = "Kurs kalendaringiz eskirgan";
"Course.COURSE_DATES.CALENDAR_SHIFT_MESSAGE" = "Kurs sanalari o‘zgartirildi va kurs taqvimingiz endi yangi jadvalingizga mos kelmaydi.";
"Course.COURSE_DATES.CALENDAR_SHIFT_PROMPT_UPDATE_NOW" = "Hozir yangilang";
"Course.COURSE_DATES.CALENDAR_EVENTS_UPDATED" = "Kurs taqvimingiz yangilandi.";
"Course.COURSE_DATES.CALENDAR_PERMISSION_NOT_DETERMINED" = "%@ taqvim ruxsatiga ega emas. Iltimos, sozlamalarga o‘ting va taqvimga ruxsat bering.";
"Course.COURSE_DATES.OPEN_SETTINGS" = "Sozlamalarni oching";
"Course.COURSE_DATES.SETTINGS" = "Sozlamalar";
"Course.COURSE_DATES.RESET_DATE.ERROR_MESSAGE" = "Sanalaringizni o‘zgartirib bo‘lmadi. Iltimos, qayta urinib ko‘ring.";
"Course.COURSE_DATES.RESET_DATE.SUCCESS_MESSAGE" = "Sanalaringiz muvaffaqiyatli almashtirildi.";
"Course.COURSE_DATES.RESET_DATE.TITLE" = "Kurs sanalari";
"Course.COURSE.DUE_TODAY" = "Muddati bugun";
"Course.COURSE.DUE_TOMORROW" = "Ertaga";
"Course.COURSE.PROGRESS_COMPLETED" = "%@ / %@ Tugallandi";
"Course.COURSE.PROGRESS_SECTIONS_COMPLETED" = "%@/%@ Bo'limlar Tugallandi";
"Course.COURSE.PROGRESS_VIDEOS_COMPLETED" = "%@ / %@ Tugallandi";
"Course.COURSE.PROGRESS_WATCHED" = "%@/%@ Ko‘rildi";
"Course.COURSE.PROGRESS_VIEW_COMPLETED" = "Ko'rinish tugallanganlarni";
"Course.COURSE.PROGRESS_HIDE_COMPLETED" = "Yakunlanganlarni yashirish";
"Course.COURSE.ASSIGNMENT_COMPLETED" = "Bajarildi";
"Course.COURSE.ASSIGNMENT_DRAG_AND_DROP" = "Drag va Drop";
"Course.COURSE.ASSIGNMENT_GENERIC" = "Topshiriq";
"Course.COURSE.ASSIGNMENT_GRADED" = "Baholangan";
"Course.COURSE.ASSIGNMENT_NOT_STARTED" = "Boshlanmagan";
"Course.COURSE.ASSIGNMENT_OPEN_ASSESSMENT" = "Ochiq baholash";
"Course.COURSE.ASSIGNMENT_PEER_INSTRUCTION" = "O‘rtoqlar orqali o‘qitish";
"Course.COURSE.ASSIGNMENT_PROBLEM" = "Masala";
"Course.COURSE.ASSIGNMENT_SURVEY" = "So'rovnoma";
"Course.COURSE.ASSIGNMENT_IN_PROGRESS" = "Jarayonda";
"Course.COURSE.ASSIGNMENT_WORD_CLOUD" = "So'z buluti";
"Course.COURSE.ASSIGNMENT_LTI" = "Tashqi vosita";
"Course.COURSE.ASSIGNMENT_DISCUSSION" = "Munozara";
"Course.COURSE.LARGEST_DOWNLOADS.TITLE" = "Eng katta yuklamalar";
"Course.COURSE.LARGEST_DOWNLOADS.DONE" = "Bajarildi";
"Course.COURSE.LARGEST_DOWNLOADS.EDIT" = "Tahrirlash";
"Course.COURSE.LARGEST_DOWNLOADS.REMOVE_DOWNLOADS" = "Barcha yuklamalarni olib tashlang";
"Course.COURSE.OFFLINE.VISIBLE" = "Ushbu kursning %@ %% mobil qurilmada ko'rinadi.";
"Course.COURSE.OFFLINE.DOWNLOADABLE" = "%@ %% ushbu kursni yuklab olish mumkin.";
"Course.COURSE.OFFLINE.CAN_BE_COMPLETED" = "%@ %% ushbu kursni oflayn rejimda yakunlash mumkin.";
"Course.COURSE.TOTAL_PROGRESS.DOWNLOADED" = "Yuklab olingan";
"Course.COURSE.TOTAL_PROGRESS.DOWNLOADING" = "Yuklab olinmoqda";
"Course.COURSE.TOTAL_PROGRESS.AVALIABLE_TO_DOWNLOAD" = "Yuklab olish uchun mavjud";
"Course.COURSE.TOTAL_PROGRESS.READY_TO_DOWNLOAD" = "Yuklab olishga tayyor";
"Course.COURSE.OFFLINE.DOWNLOAD_ALL" = "Hammasini yuklab oling";
"Course.COURSE.OFFLINE.CANCEL_COURSE_DOWNLOAD" = "Kursni yuklab olishni bekor qilish";
"Course.COURSE.OFFLINE.YOU_CAN_DOWNLOAD" = "Faol internet ulanishini talab qilmasdan yoki mobil internetdan foydalanmasdan turib oʻrganish uchun kurs tarkibini oflayn rejimda yuklab olishingiz mumkin.";
"Course.COURSE.OFFLINE.YOU_CANT_DOWNLOAD" = "Hozirda ushbu kurs mazmunining hech biri oflayn yuklab olish uchun mavjud emas.";
"Course.COURSE.RETURN_TO_HOME" = "Kurs bosh sahifasiga qaytish";
"Course.OFFLINE.NOT_DOWNLOADED.TITLE" = "Ushbu komponent yuklab olinmagan";
"Course.OFFLINE.NOT_DOWNLOADED.DESCRIPTION" = "Ushbu kursning boshqa qismlarini oʻrganing yoki qayta ulanganingizda uni yuklab oling.";
"Course.OFFLINE.NOT_AVALIABLE.TITLE" = "Ushbu komponent hali oflayn rejimda mavjud emas";
"Course.OFFLINE.NOT_AVALIABLE.DESCRIPTION" = "Ushbu kursning boshqa qismlarini oʻrganing yoki qayta ulanganingizda buni koʻring.";
"Course.CALENDAR_SYNC_STATUS.SYNCED" = "Taqvim bilan sinxronlangan";
"Course.CALENDAR_SYNC_STATUS.FAILED" = "Taqvimni sinxronlash amalga oshmadi";
"Course.CALENDAR_SYNC_STATUS.OFFLINE" = "Oflayn";
"Course.ASSIGNMENT_STATUS.COMPLETE" = "%@ Tugallandi - %@/%@ ball";
"Course.ASSIGNMENT_STATUS.PAST_DUE" = "%@ Muddati O'tgan - %@/%@ ball";
"Course.ASSIGNMENT_STATUS.NOT_YET_AVAILABLE" = "%@ Hozircha Mavjud Emas";
"Course.ASSIGNMENT_STATUS.IN_PROGRESS" = "%@ - %@/%@ ball";
"Course.ASSIGNMENT_STATUS.DUE_WITH_DATE" = "%@ %@";
"Course.ASSIGNMENT.REVIEW_GRADING_POLICY" = "Kurs baholash siyosatini ko‘rib chiqish";
"Course.ASSIGNMENT.UNKNOWN_SEQUENCE" = "Noma'lum";
"Course.ACCESSIBILITY.COURSE_PROGRESS_SECTION" = "Kursning rivojlanish bo'limi";
"Course.ACCESSIBILITY.CONTINUE_LEARNING_SECTION" = "O‘qishni davom ettirish bo‘limi";
"Course.ACCESSIBILITY.COURSE_CONTENT_SECTION" = "Kurs mazmuni bo'limi";
"Course.ACCESSIBILITY.ERROR_MESSAGE_SECTION" = "Xatolik xabari bo'limi";
"Course.ACCESSIBILITY.LOADING_SECTION" = "Yuklanmoqda bo'limi";
"Course.ACCESSIBILITY.VIDEOS_SECTION" = "Video bo'limi";
"Course.ACCESSIBILITY.VIDEO_PROGRESS_SECTION" = "Video jarayoni %@ dan %@ gacha tugallandi.";
"Course.ACCESSIBILITY.ASSIGNMENTS_SECTION" = "Topshiriqlar bo'limi";
"Course.ACCESSIBILITY.ASSIGNMENT_PROGRESS_SECTION" = "Topshiriqning bajarilishi bo'limi";
"Course.ACCESSIBILITY.NO_CONTENT_SECTION" = "Mavjud kontent yo'q bo'limi";
"Course.ACCESSIBILITY.CAROUSEL.NEXT_SLIDE_BUTTON" = "Keyingi sahifa";
"Course.ACCESSIBILITY.CAROUSEL.LAST_SLIDE_BUTTON" = "Oxirgi sahifa";
"Course.ACCESSIBILITY.CAROUSEL.PREVIOUS_SLIDE_BUTTON" = "Oldingi sahifa";
"Course.ACCESSIBILITY.CAROUSEL.ASSIGNMENTS_COMPLETED" = "%@ %@ topshiriqlari bajarildi";
"Course.ACCESSIBILITY.HIDE_COMPLETED_SECTIONS" = "Bajarilgan bo'limlarni yashirish uchun bosing";
"Course.ACCESSIBILITY.SHOW_COMPLETED_SECTIONS" = "Bajarilgan bo'limlarni ko'rsatish uchun bosing";
"Course.ACCESSIBILITY.VIDEO_SECTION_HEADER" = "%@ bo'lim, %@ dan %@ ta video ko'rildi";
"Course.ACCESSIBILITY.DOWNLOAD_SECTION_BUTTON" = "Yuklab olish bo'limi, %@";
"Course.ACCESSIBILITY.VIDEO_THUMBNAIL" = "Video: %@";
"Course.ACCESSIBILITY.VIDEO_THUMBNAIL_COMPLETED" = "%@, tugallandi";
"Course.ACCESSIBILITY.VIDEO_THUMBNAIL_IN_PROGRESS" = "%@, %@%% tomosha qilindi";
"Course.ACCESSIBILITY.VIDEO_THUMBNAIL_NOT_STARTED" = "%@, boshlanmagan";
"Course.ACCESSIBILITY.VIDEO_THUMBNAIL_HINT" = "Videoni ijro etish uchun bosing";
"Course.ACCESSIBILITY.VIDEO_PERCENTAGE_COMPLETED" = "%@ foiz bajarildi";
"Course.ACCESSIBILITY.VIDEO_NAVIGATION_COUNT" = "Video %@ dan %@";
"Course.ACCESSIBILITY.VIDEO_NAVIGATION" = "Video navigatsiyasi";
"Course.VIDEO_NAVIGATION.NO_VIDEO_TITLE" = "Video sarlavhasi yo'q";
"Authorization.SIGN_IN.LOG_IN_TITLE" = "Tizimga kirish";
"Authorization.SIGN_IN.WELCOME_BACK" = "Qaytib kelganingizdan xursandmiz! Kurslaringizga kirish uchun tizimga kiring.";
"Authorization.SIGN_IN.EMAIL" = "Elektron pochta";
"Authorization.SIGN_IN.EMAIL_OR_USERNAME" = "Elektron pochta yoki foydalanuvchi nomi";
"Authorization.SIGN_IN.PASSWORD" = "Parol";
"Authorization.SIGN_IN.FORGOT_PASS_BTN" = "Parolni unutdingizmi?";
"Authorization.SIGN_IN.SELECTED_SITE" = "";
"Authorization.SIGN_IN.CHANGE" = "O'zgartirish";
"Authorization.SIGN_IN.AGREEMENT" = "Ushbu ilovaga kirish orqali siz [ %@ Yakuniy foydalanuvchi litsenziya shartnomasi]( %@ ) va [ %@ Foydalanish shartlari va hurmat kodi]( %@ ) %@ z0 va har bir a‘zo shaxsiy ma‘lumotlaringizni qayta ishlaydi\n [Maxfiylik siyosati.]( %@ ) ga muvofiq";
"Authorization.SIGN_IN.SSO_HEADING" = "Karyerangizni ishonch bilan qurish uchun bugundan boshlang";
"Authorization.SIGN_IN.SSO_SUPPORTING_TEXT" = "Endowment sektori va uning xodimlarini rivojlantirish uchun bilim va imkoniyatlarni oshirish dasturlarining integratsiyalashgan to'plami";
"Authorization.SIGN_IN.SSO_LOG_IN_TITLE" = "tizimga kirish";
"Authorization.SIGN_IN.SSO_LOG_IN_SUBTITLE" = "Milliy yagona tizimga kirish xizmati orqali tizimga kiring";
"Authorization.ERROR.INVALID_EMAIL_ADDRESS" = "Yaroqsiz elektron pochta manzili";
"Authorization.ERROR.INVALID_PASSWORD_LENGHT" = "Parol uzunligi noto‘g‘ri";
"Authorization.ERROR.ACCOUNT_NOT_REGISTERED" = "Bu %@ accounti hech qanday %@ accountiga bog‘lanmagan. Ro‘yxatdan oʻting.";
"Authorization.ERROR.INVALID_EMAIL_ADDRESS_OR_USERNAME" = "Yaroqsiz email yoki foydalanuvchi nomi";
"Authorization.ERROR.DISABLED_ACCOUNT" = "Accountingiz o‘chirilgan. Iltimos, yordam uchun mijozlarni qo‘llab-quvvatlash xizmatiga murojaat qiling.";
"Authorization.SIGN_UP.SUBTITLE" = "Bugun o‘rganishni boshlash uchun account yarating!";
"Authorization.SIGN_UP.CREATE_ACCOUNT_BTN" = "Account yaratish";
"Authorization.SIGN_UP.HIDE_FIELDS" = "Ixtiyoriy maydonlarni yashirish";
"Authorization.SIGN_UP.SHOW_FIELDS" = "Ixtiyoriy maydonlarni ko‘rsatish";
"Authorization.SIGN_UP.SUCCESS_SIGNIN_LABEL" = "Siz tizimga muvaffaqiyatli kirdingiz.";
"Authorization.SIGN_UP.SUCCESS_SIGNIN_SUBLABEL" = "O‘rganishni boshlashdan oldin bizga biroz ko‘proq ma'lumot kerak.";
"Authorization.SIGN_UP.AGREEMENT" = "Account yaratish orqali siz [ %@ Yakuniy foydalanuvchi litsenziya shartnomasi]( %@ ) va [ %@ Xizmat ko‘rsatish shartlari va hurmat kodeksi]( %@ ) va %@ rozilik bildirasiz Har bir a‘zo shaxsiy ma‘lumotlaringizni [Maxfiylik siyosatiga muvofiq qayta ishlaydi .]( %@ )";
"Authorization.SIGN_UP.MARKETING_EMAIL_TITLE" = "Men %@ menga marketing xabarlarini yuborishiga roziman.";
"Authorization.FORGOT.TITLE" = "Parolni unutdingizmi";
"Authorization.FORGOT.DESCRIPTION" = "Iltimos, quyida tizimga kirish yoki qayta tiklanadigan elektron pochta manzilingizni kiriting va biz sizga ko‘rsatmalar bilan elektron pochta xabarini yuboramiz.";
"Authorization.FORGOT.REQUEST" = "Parolni tiklash";
"Authorization.FORGOT.CHECK_TITLE" = "Elektron pochtangizni tekshiring";
"Authorization.FORGOT.CHECK_Description" = "E-pochtangizga parolni tiklash bo‘yicha ko‘rsatmalar yubordik ";
"Authorization.CONTINUE_WITH" = "Davom eting:";
"Authorization.LAST_SIGN_IN" = "Oxirgi kirish";
"Authorization.OR_SIGN_IN_WITH" = "Yoki elektron pochta orqali tizimga kiring:";
"Authorization.OR_REGISTER_WITH" = "Yoki quyida ro'yxatdan o'ting:";
"Authorization.APPLE" = "Olma";
"Authorization.GOOGLE" = "Google";
"Authorization.FACEBOOK" = "Facebook";
"Authorization.MICROSOFT" = "Microsoft";
"Authorization.OR" = "Yoki";
"Authorization.STARTUP.INFO_MESSAGE" = "Dunyoning eng yaxshi universitetlari kurslari va dasturlari sizning cho‘ntagingizda.";
"Authorization.STARTUP.SEARCH_TITLE" = "Siz nimani o‘rganmoqchisiz?";
"Authorization.STARTUP.SEARCH_PLACEHOLDER" = "3000 dan ortiq kurslarimizni qidiring";
"Authorization.STARTUP.EXPLORE_ALL_COURSES" = "Barcha kurslarni o‘rganing";
"Authorization.STARTUP.TITLE" = "Boshlash";
"Authorization.LEARNING_SITES.TITLE" = "";
"Authorization.LEARNING_SITES.GET_STARTED" = "Boshlash";
"Authorization.LEARNING_SITES.WELCOME_SUBTITLE" = "";
"Authorization.LEARNING_SITES.SEARCH_TITLE" = "Qidiruv";
"Authorization.LEARNING_SITES.SUBTITLE" = "";
"Authorization.LEARNING_SITES.CURRENT_SITE" = "";
"Authorization.LEARNING_SITES.MORE_SITES" = "";
"Authorization.LEARNING_SITES.ADD_SITE" = "";
"Authorization.LEARNING_SITES.SEARCH_PLACEHOLDER" = "";
"Authorization.LEARNING_SITES.EMPTY_SEARCH" = "";
"Authorization.LEARNING_SITES.LOG_OUT_TITLE" = "Chiqish";
"Authorization.LEARNING_SITES.LOG_OUT_MESSAGE" = "";
"Authorization.LEARNING_SITES.LOG_OUT_ACTION" = "Chiqish";
"WhatsNew.TITLE" = "Nima yangiliklar";
"WhatsNew.BUTTON_PREVIOUS" = "Oldingi";
"WhatsNew.BUTTON_NEXT" = "Keyingisi";
"WhatsNew.BUTTON_DONE" = "Bajarildi";
"Dashboard.TITLE" = "Boshqaruv paneli";
"Dashboard.HEADER.COURSES" = "Kurslar";
"Dashboard.HEADER.WELCOME_BACK" = "Qaytib kelganingizdan xursandmiz. Keling, o‘rganishda davom etaylik.";
"Dashboard.SEARCH" = "Qidiruv";
"Dashboard.EMPTY.SUBTITLE" = "Siz hali hech qanday kursga yozilmagansiz.";
"Dashboard.LEARN.TITLE" = "O‘rganing";
"Dashboard.LEARN.VIEW_ALL" = "Hammasini ko‘rish";
"Dashboard.LEARN.VIEW_ALL_COURSES" = "Barcha kurslarni ko‘rish ( %@ )";
"Dashboard.LEARN.ALL_COURSES" = "Barcha Kurslar";
"Dashboard.LEARN.PRIMARY_CARD.ONE_PAST_ASSIGNMENT" = "1 Muddati o‘tgan topshiriq";
"Dashboard.LEARN.PRIMARY_CARD.VIEW_ASSIGNMENTS" = "Topshiriqlarni ko‘rish";
"Dashboard.LEARN.PRIMARY_CARD.PAST_ASSIGNMENTS" = "%@ Muddati o‘tgan topshiriqlar";
"Dashboard.LEARN.PRIMARY_CARD.FUTURE_ASSIGNMENTS" = "%@ Muddati bor topshiriqlar %@ ";
"Dashboard.LEARN.PRIMARY_CARD.DUE_DAYS" = "%@ Muddati %@ kun ichida";
"Dashboard.LEARN.PRIMARY_CARD.RESUME" = "Kursni davom ettirish";
"Dashboard.LEARN.PRIMARY_CARD.START_COURSE" = "Kursni boshlash";
"Dashboard.LEARN.DROPDOWN_MENU.COURSES" = "Kurslar";
"Dashboard.LEARN.DROPDOWN_MENU.PROGRAMS" = "Dasturlar";
"Dashboard.LEARN.CATEGORY.ALL" = "Hammasi";
"Dashboard.LEARN.CATEGORY.IN_PROGRESS" = "Jarayonda";
"Dashboard.LEARN.CATEGORY.COMPLETED" = "Bajarildi";
"Dashboard.LEARN.CATEGORY.EXPIRED" = "Muddati tugagan";
"Dashboard.LEARN.NO_COURSES_VIEW.NO_COURSES" = "Kurslar yo‘q";
"Dashboard.LEARN.NO_COURSES_VIEW.NO_COURSES_IN_PROGRESS" = "Davom etayotgan kurslar yo‘q";
"Dashboard.LEARN.NO_COURSES_VIEW.NO_COMPLETED_COURSES" = "Tugallangan kurslar yo‘q";
"Dashboard.LEARN.NO_COURSES_VIEW.NO_EXPIRED_COURSES" = "Muddati o‘tgan kurslar yo‘q";
"Dashboard.LEARN.NO_COURSES_VIEW.NO_COURSES_DESCRIPTION" = "Siz hozirda hech qanday kursga yozilmagansiz, kurslar katalogini o‘rganmoqchimisiz?";
"Dashboard.LEARN.NO_COURSES_VIEW.FIND_A_COURSE" = "Kurs toping";
"Core.MAINSCREEN.DISCOVERY" = "Kashf qiling";
"Core.MAINSCREEN.DASHBOARD" = "Boshqaruv paneli";
"Core.MAINSCREEN.IN_DEVELOPING" = "Rivojlanishda";
"Core.MAINSCREEN.PROGRAMS" = "Dasturlar";
"Core.MAINSCREEN.PROFILE" = "Profil";
"Core.MAINSCREEN.LEARN" = "O‘rganing";
"Core.MAINSCREEN.SOCIAL_REGISTER_BANNER" = "Siz allaqachon %@ akkaunt bilan %@ akkaunt o'rnatgansiz. Siz o'sha akkaunt bilan tizimga kirgansiz.";
"Core.VIEW.SNACKBAR.TRY_AGAIN_BTN" = "Qayta urinib ko‘ring";
"Core.ERROR.INVALID_CREDENTIALS" = "Hisob ma'lumotlari yaroqsiz";
"Core.ERROR.SLOW_OR_NO_INTERNET_CONNECTION" = "Internetga ulanish sekin yoki yo‘q";
"Core.ERROR.NO_CACHED_DATA" = "Oflayn rejim uchun keshlangan maʼlumotlar yoʻq";
"Core.ERROR.USER_NOT_ACTIVE" = "Foydalanuvchi accounti faollashtirilmagan. Iltimos, avval accountingizni faollashtiring.";
"Core.ERROR.UNKNOWN_ERROR" = "Nimadir xato ketdi";
"Core.ERROR.WIFI" = "Fayllarni faqat Wi-Fi orqali yuklab olishingiz mumkin. Buni sozlamalarda o‘zgartirishingiz mumkin.";
"Core.ERROR.AUTHORIZATION_FAILED" = "Avtorizatsiya amalga oshmadi.";
"Core.ERROR.INTERNET.NO_INTERNET_TITLE" = "Internet aloqasi yo‘q";
"Core.ERROR.INTERNET.NO_INTERNET_DESCRIPTION" = "Ushbu tarkibni ko‘rish uchun internetga ulaning.";
"Core.COURSEWARE.COURSE_CONTENT" = "Kurs mazmuni";
"Core.COURSEWARE.COURSE_CONTENT_NOT_AVAILABLE" = "Ushbu interaktiv komponent hali mobil qurilmada mavjud emas.";
"Core.COURSEWARE.COURSE_UNITS" = "Kurs birliklari";
"Core.COURSEWARE.NEXT" = "Keyingisi";
"Core.COURSEWARE.PREVIOUS" = "Oldingi";
"Core.COURSEWARE.FINISH" = "Tugatish";
"Core.COURSEWARE.GOOD_WORK" = "Yaxshi bajarilgan ish!";
"Core.COURSEWARE.BACK_TO_OUTLINE" = "Konturga qaytish";
"Core.COURSEWARE.SECTION_COMPLETED" = "Siz “ %@ ” ni tugatdingiz.";
"Core.COURSEWARE.CONTINUE" = "Davom eting";
"Core.COURSEWARE.RESUME" = "Rezyume; qayta boshlash";
"Core.COURSEWARE.RESUME_WITH" = "Davom etish:";
"Core.COURSEWARE.NEXT_SECTION" = "Keyingi bo‘lim";
"Core.COURSEWARE.NEXT_SECTION_DESCRIPTION_FIRST" = "Davom etish uchun “";
"Core.COURSEWARE.NEXT_SECTION_DESCRIPTION_LAST" = "\"Keyingi bo‘lim\" tugmasini bosing.";
"Core.ERROR.RELOAD" = "Qayta yuklash";
"Core.DATE.COURSE_STARTS" = "Kurs boshlanadi";
"Core.DATE.COURSE_ENDS" = "Kurs tugaydi";
"Core.DATE.COURSE_ENDED" = "Kurs tugadi";
"Core.DATE.ENDED" = "Tugadi";
"Core.DATE.START" = "Boshlash";
"Core.DATE.STARTED" = "Boshlandi";
"Core.DATE.JUST_NOW" = "Hozir";
"Core.DATE.TODAY" = "Bugun";
"Core.DATE.NEXT" = "Keyingi %@";
"Core.DATE.DAYS_AGO" = "%@ Kunlar oldin";
"Core.DATE.DUE" = "Muddati ";
"Core.DATE.DUE_IN" = "To'lov muddati ";
"Core.DATE.DUE_IN_DAYS" = "%@ kun ichida toʻlanadi";
"Core.DATE.DUE_TODAY" = "Bugun topshirilishi kerak: %@";
"Core.DATE.DUE_DATE_PAST" = "%@ kun kechikkan: %@";
"Core.DATE.DUE_IN_LEFT" = "%@ kun ichida topshiriladi: %@";
"Core.ALERT.ACCEPT" = "Qabul qiling";
"Core.ALERT.CANCEL" = "Bekor qilish";
"Core.ALERT.LOGOUT" = "Chiqish";
"Core.ALERT.LEAVE" = "Ketish";
"Core.ALERT.SIGN_IN" = "Tizimga kirish";
"Core.ALERT.REGISTER" = "Roʻyxatdan oʻtish";
"Core.ALERT.KEEP_EDITING" = "Tahrirlashda davom eting";
"Core.ALERT.DELETE" = "Oʻchirish";
"Core.ALERT.ADD" = "Qo‘shish";
"Core.ALERT.REMOVE" = "Olib tashlash";
"Core.ALERT.CALENDAR_SHIFT_PROMPT_REMOVE_COURSE_CALENDAR" = "Kurs taqvimini olib tashlang";
"Core.NO_INTERNET.OFFLINE" = "Oflayn";
"Core.NO_INTERNET.DISMISS" = "Rad etish";
"Core.NO_INTERNET.RELOAD" = "Qayta yuklash";
"Core.DATE_FORMAT.MMMM_DD" = "AAMM dd";
"Core.DATE_FORMAT.MMM_DD_YYYY" = "MMM dd, yyyy";
"Core.DATE_FORMAT.MMMM_DD_YYYY" = "AAAA dd, yyyy";
"Core.DOWNLOAD_MANAGER.DOWNLOAD" = "Yuklab olish";
"Core.DOWNLOAD_MANAGER.DOWNLOADED" = "Yuklab olingan";
"Core.DOWNLOAD_MANAGER.COMPLETED" = "Bajarildi";
"Core.SETTINGS.VIDEO_DOWNLOAD_QUALITY_TITLE" = "Video yuklab olish sifati";
"Core.SETTINGS.DOWNLOAD_QUALITY_AUTO_TITLE" = "Avtomatik";
"Core.SETTINGS.DOWNLOAD_QUALITY_AUTO_DESCRIPTION" = "Tavsiya etilgan";
"Core.SETTINGS.DOWNLOAD_QUALITY_360_TITLE" = "360p";
"Core.SETTINGS.DOWNLOAD_QUALITY_360_DESCRIPTION" = "Kamroq maʼlumotlardan foydalanish";
"Core.SETTINGS.DOWNLOAD_QUALITY_540_TITLE" = "540p";
"Core.SETTINGS.DOWNLOAD_QUALITY_720_TITLE" = "720p";
"Core.SETTINGS.DOWNLOAD_QUALITY_720_DESCRIPTION" = "Eng yaxshi sifat";
"Core.DONE" = "Bajarildi";
"Core.VIEW" = "ko'rish";
"Core.BACK" = "Orqaga";
"Core.OK" = "Kelishdikmi";
"Core.CLOSE" = "Yopish";
"Core.PICKER.SEARCH" = "Qidiruv";
"Core.PICKER.ACCEPT" = "Qabul qiling";
"Core.WEBVIEW.ALERT.OK" = "Kelishdikmi";
"Core.WEBVIEW.ALERT.CANCEL" = "Bekor qilish";
"Core.WEBVIEW.ALERT.CONTINUE" = "Davom eting";
"Core.REVIEW.VOTE_TITLE" = "Open edX yoqyapsizmi?";
"Core.REVIEW.VOTE_DESCRIPTION" = "Sizning fikr-mulohazalaringiz biz uchun muhim. Quyidagi yulduzchaga tegib, ilovaga bir oz vaqt ajratasizmi? Qo‘llab-quvvatlaganingiz uchun tashakkur!";
"Core.REVIEW.FEEDBACK_TITLE" = "Bizga fikr-mulohaza qoldiring";
"Core.REVIEW.FEEDBACK_DESCRIPTION" = "Taʼlim tajribangizda baʼzi muammolar yuzaga kelganidan afsusdamiz. Biz barcha fikr-mulohazalarni qadrlaymiz.";
"Core.REVIEW.THANKS_FOR_VOTE_TITLE" = "Rahmat";
"Core.REVIEW.THANKS_FOR_VOTE_DESCRIPTION" = "Fikr-mulohazangizni biz bilan baham ko‘rganingiz uchun tashakkur. Ushbu ilova haqidagi sharhingizni ilovalar do‘konidagi boshqa foydalanuvchilar bilan baham ko‘rmoqchimisiz?";
"Core.REVIEW.THANKS_FOR_FEEDBACK_TITLE" = "Rahmat";
"Core.REVIEW.THANKS_FOR_FEEDBACK_DESCRIPTION" = "Biz sizning fikr-mulohazalaringizni oldik va undan keyingi taʼlim tajribangizni yaxshilash uchun foydalanamiz. Baham ko‘rganingiz uchun tashakkur!";
"Core.REVIEW.BETTER" = "Nima yaxshiroq bo‘lishi mumkin edi?";
"Core.REVIEW.NOT_NOW" = "Hozir emas";
"Core.REVIEW.BUTTON.SUBMIT" = "Yuborish";
"Core.REVIEW.BUTTON.SHARE_FEEDBACK" = "Fikr-mulohaza ulashing";
"Core.REVIEW.BUTTON.RATE_US" = "Bizga baho bering";
"Core.REVIEW.EMAIL.TITLE" = "Elektron pochta mijozini tanlang:";
"Core.SOCIAL_SIGN_CANCELED" = "Foydalanuvchi tizimga kirish jarayonini bekor qildi.";
"Core.SIGN_IN.LOG_IN_BTN" = "Tizimga kirish";
"Core.SIGN_IN.REGISTER_BTN" = "Roʻyxatdan oʻtish";
"Core.SIGN_IN.LOG_IN_WITH_SSO_BTN" = "SSO bilan tizimga kiring";
"Core.TOMORROW" = "Ertaga";
"Core.YESTERDAY" = "Kecha";
"Core.OPEN_IN_BROWSER" = "Safari-da ko‘rish";
"Core.COURSE_DATES.RESET_DATE.RESET_DATE_BANNER.BODY" = "Xavotir olmang – hech qanday taraqqiyotni yo‘qotmasdan, muddati o‘tgan topshiriqlarni bajarish uchun tavsiya etilgan jadvalimizni o‘zgartiring.";
"Core.COURSE_DATES.RESET_DATE.RESET_DATE_BANNER.BUTTON" = "Tugatish sanalari";
"Core.COURSE_DATES.RESET_DATE.RESET_DATE_BANNER.HEADER" = "Ba‘zi muddatlarni o‘tkazib yubordingizmi?";
"Core.COURSE_DATES.RESET_DATE.TAB_INFO_BANNER.BODY" = "Yo‘lda qolishingizga yordam berish uchun tavsiya etilgan jadval tuzdik. Lekin tashvishlanmang - u moslashuvchan, shuning uchun siz o‘z tezligingizda o‘rganishingiz mumkin. Agar siz ortda qolib ketsangiz, o‘zingizni kuzatib borish uchun sanalarni moslashtira olasiz.";
"Core.COURSE_DATES.RESET_DATE.TAB_INFO_BANNER.HEADER" = "";
"Core.COURSE_DATES.RESET_DATE.UPGRADE_TO_COMPLETE_GRADED_BANNER.BODY" = "Ushbu kursning bir qismi sifatida baholangan topshiriqlarni bajarish uchun siz bugun yangilashingiz mumkin.";
"Core.COURSE_DATES.RESET_DATE.UPGRADE_TO_COMPLETE_GRADED_BANNER.BUTTON" = "";
"Core.COURSE_DATES.RESET_DATE.UPGRADE_TO_COMPLETE_GRADED_BANNER.HEADER" = "";
"Core.COURSE_DATES.RESET_DATE.UPGRADE_TO_RESET_BANNER.BODY" = "Siz ushbu kursni tekshirmoqdasiz, demak, siz baholi topshiriqlarda qatnasha olmaysiz. Tavsiya etilgan jadvalimiz asosida muhim muddatlarni o‘tkazib yuborganga o‘xshaysiz. Ushbu kursning bir qismi sifatida baholangan topshiriqlarni bajarish va o‘tgan topshiriqlarni kelajakka o‘tkazish uchun siz bugun yangilashingiz mumkin.";
"Core.COURSE_DATES.RESET_DATE.UPGRADE_TO_RESET_BANNER.BUTTON" = "";
"Core.COURSE_DATES.RESET_DATE.UPGRADE_TO_RESET_BANNER.HEADER" = "";
"Core.COURSE_DATES.RESET_DATE.ERROR_MESSAGE" = "Sanalaringizni o‘zgartirib bo‘lmadi. Iltimos, qayta urinib ko‘ring.";
"Core.COURSE_DATES.RESET_DATE.SUCCESS_MESSAGE" = "Sanalaringiz muvaffaqiyatli almashtirildi.";
"Core.COURSE_DATES.RESET_DATE.TITLE" = "Kurs sanalari";
"Core.COURSE_DATES.TODAY" = "Bugun";
"Core.COURSE_DATES.COMPLETED" = "Bajarildi";
"Core.COURSE_DATES.PAST_DUE" = "Muddati o‘tgan";
"Core.COURSE_DATES.THIS_WEEK" = "Ushbu hafta";
"Core.COURSE_DATES.NEXT_WEEK" = "Keyingi hafta";
"Core.COURSE_DATES.UPCOMING" = "Kelgusi";
"Core.COURSE.STORAGE_ALERT.TITLE" = "Qurilma xotirasi toʻliq";
"Core.COURSE.STORAGE_ALERT.DESCRIPTION" = "Ushbu kontentni yuklab olish uchun qurilmangizda boʻsh joy yetarli emas. Biroz joy boʻshating va qayta urinib koʻring.";
"Core.COURSE.STORAGE_ALERT.USED_AND_FREE" = "%@ ishlatilgan, %@ bepul";
"Core.COURSE.ALERT.CANCEL" = "Bekor qilish";
"Core.COURSE.ALERT.CLOSE" = "Yopish";
"Core.COURSE.ALERT.REMOVE" = "O'chirish";
"Core.COURSE.ALERT.DOWNLOAD" = "Yuklab olish";
"Core.COURSE.ALERT.TRY_AGAIN" = "Qayta urinib ko‘ring";
"Core.COURSE.ALERT.REMOVE_TITLE" = "Oflayn kontentni olib tashlash kerakmi?";
"Core.COURSE.ALERT.CONFIRM_DOWNLOAD_TITLE" = "Yuklashni tasdiqlang";
"Core.COURSE.ALERT.CONFIRM_DOWNLOAD_CELLULAR_TITLE" = "Uyali tarmoqqa yuklab olishni xohlaysizmi?";
"Core.COURSE.ALERT.REMOVE_DESCRIPTION" = "";
"Core.COURSE.ALERT.CONFIRM_DOWNLOAD_DESCRIPTION" = "Ushbu %@ kontentni yuklab olish mavjud bloklarni oflayn rejimda saqlaydi.";
"Core.COURSE.ALERT.CONFIRM_DOWNLOAD_CELLULAR_DESCRIPTION" = "Ushbu kontentni yuklab olish uchun %@ uyali maʼlumotlar ishlatiladi.";
"Core.COURSE.ERROR.DOWNLOAD_FAILED_TITLE" = "Yuklab bo‘lmadi";
"Core.COURSE.ERROR.NO_INTERNET_CONNECTION_TITLE" = "Internet aloqasi yo'q";
"Core.COURSE.ERROR.WIFI_REQUIRED_TITLE" = "Wi-Fi kerak";
"Core.COURSE.ERROR.DOWNLOAD_FAILED_DESCRIPTION" = "Afsuski, bu kontent yuklab olinmadi. Keyinroq qayta urinib ko‘ring yoki bu muammo haqida xabar bering.";
"Core.COURSE.ERROR.NO_INTERNET_CONNECTION_DESCRIPTION" = "Ushbu kontentni yuklab olish uchun faol internet aloqasi talab qilinadi. Internetga ulaning va qaytadan urining.";
"Core.COURSE.ERROR.WIFI_REQUIRED_DESCRIPTION" = "Ushbu kontentni yuklab olish uchun faol WiFi ulanishi kerak. Wi-Fi tarmog‘iga ulaning va qaytadan urinib ko‘ring.";
"Core.DOWNLOAD.DOWNLOAD_LARGE_FILE_MESSAGE" = "Siz tanlagan video hajmi 1 GB dan katta. Ushbu videolarni yuklab olishni xohlaysizmi?";
"Core.DOWNLOAD.DOWNLOAD" = "Yuklab olish";
"Core.ALERT.ACCEPT" = "Qabul qiling";
